//------------------------------------------------------------------------------
// triangle.cpp - содержит функции обработки треугольника
//------------------------------------------------------------------------------

#include "CyclicEncryption.h"

//------------------------------------------------------------------------------
// Ввод параметров треугольника из потока
void In(CyclicEncryption &t, ifstream &ifst) {
    ifst >> t.n >> t.text;
}

// Случайный ввод параметров треугольника
void InRnd(CyclicEncryption &t) {
    t.n = RandomInt();
    t.text = Random();
}

//------------------------------------------------------------------------------
// Вывод параметров треугольника в поток
void Out(CyclicEncryption &t, ofstream &ofst) {
    ofst << "It is CyclicEncryption: n = "
         << t.n << ", Text = " << t.text
         << ". Function = " << Encryption(t) << "\n";
}

//------------------------------------------------------------------------------
// Вычисление периметра треугольника
double Encryption(CyclicEncryption &t) {
    return 1.0;
}



